[Killed] BlockStatement
datasets/components/items/dataset-items-layout.tsx:19:111
  * (preferred) or the versions panel (fallback), and collapses entirely when
  * neither is present.
  */
-export function DatasetItemsLayout({ listSlot, detailPanelSlot, versionsPanelSlot }: DatasetItemsLayoutProps) {
-  const showDetail = !!detailPanelSlot;
-  const showVersions = !showDetail && !!versionsPanelSlot;
-
-  return (
-    <div
-      className={cn('grid h-full max-h-full min-h-0', {
-        'grid-cols-[1fr_1fr] gap-4': showDetail,
-        'grid-cols-[1fr_auto]': showVersions,
-      })}
-    >
-      <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions && 'pr-6')}>
-        {listSlot}
-      </div>
-      {showDetail && <div className="h-full min-h-0 py-3">{detailPanelSlot}</div>}
-      {showVersions && versionsPanelSlot}
-    </div>
-  );
-}
+export function DatasetItemsLayout({ listSlot, detailPanelSlot, versionsPanelSlot }: DatasetItemsLayoutProps) {}
 
killedBy: DatasetItemsLayout renders the list slot
statusReason: Unable to find an element by: [data-testid="list"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
datasets/components/items/dataset-items-layout.tsx:20:23
  * neither is present.
  */
 export function DatasetItemsLayout({ listSlot, detailPanelSlot, versionsPanelSlot }: DatasetItemsLayoutProps) {
-  const showDetail = !!detailPanelSlot;
+  const showDetail = !detailPanelSlot;
   const showVersions = !showDetail && !!versionsPanelSlot;
 
killedBy: DatasetItemsLayout renders the detail panel with vertical spacing when provided
statusReason: Unable to find an element by: [data-testid="detail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="grid h-full max-h-full min-h-0"
    >

[Killed] LogicalOperator
datasets/components/items/dataset-items-layout.tsx:21:24
  */
 export function DatasetItemsLayout({ listSlot, detailPanelSlot, versionsPanelSlot }: DatasetItemsLayoutProps) {
   const showDetail = !!detailPanelSlot;
-  const showVersions = !showDetail && !!versionsPanelSlot;
+  const showVersions = !showDetail || !!versionsPanelSlot;
 
   return (
killedBy: DatasetItemsLayout shows the detail panel and suppresses the versions panel when both are present
statusReason: expected <div data-testid="versions"></div> to be null

[Killed] ConditionalExpression
datasets/components/items/dataset-items-layout.tsx:21:24
  */
 export function DatasetItemsLayout({ listSlot, detailPanelSlot, versionsPanelSlot }: DatasetItemsLayoutProps) {
   const showDetail = !!detailPanelSlot;
-  const showVersions = !showDetail && !!versionsPanelSlot;
+  const showVersions = true;
 
   return (
killedBy: DatasetItemsLayout shows the detail panel and suppresses the versions panel when both are present
statusReason: expected <div data-testid="versions"></div> to be null

[Survived] ObjectLiteral
datasets/components/items/dataset-items-layout.tsx:25:55
 
   return (
     <div
-      className={cn('grid h-full max-h-full min-h-0', {
-        'grid-cols-[1fr_1fr] gap-4': showDetail,
-        'grid-cols-[1fr_auto]': showVersions,
-      })}
+      className={cn('grid h-full max-h-full min-h-0', {})}
     >
       <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions && 'pr-6')}>

[Survived] LogicalOperator
datasets/components/items/dataset-items-layout.tsx:30:91
         'grid-cols-[1fr_auto]': showVersions,
       })}
     >
-      <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions && 'pr-6')}>
+      <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions || 'pr-6')}>
         {listSlot}
       </div>

[Survived] ConditionalExpression
datasets/components/items/dataset-items-layout.tsx:30:91
         'grid-cols-[1fr_auto]': showVersions,
       })}
     >
-      <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions && 'pr-6')}>
+      <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', false)}>
         {listSlot}
       </div>

[Killed] LogicalOperator
datasets/components/items/dataset-items-layout.tsx:33:8
       <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions && 'pr-6')}>
         {listSlot}
       </div>
-      {showDetail && <div className="h-full min-h-0 py-3">{detailPanelSlot}</div>}
+      {showDetail || <div className="h-full min-h-0 py-3">{detailPanelSlot}</div>}
       {showVersions && versionsPanelSlot}
     </div>
killedBy: DatasetItemsLayout renders the detail panel with vertical spacing when provided
statusReason: Unable to find an element by: [data-testid="detail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="grid h-full max-h-full min-h-0 grid-cols-[1fr_1fr] gap-4"
    >

[Killed] ConditionalExpression
datasets/components/items/dataset-items-layout.tsx:33:8
       <div className={cn('grid max-w-full content-start gap-8 overflow-y-auto pt-3 pl-6', showVersions && 'pr-6')}>
         {listSlot}
       </div>
-      {showDetail && <div className="h-full min-h-0 py-3">{detailPanelSlot}</div>}
+      {false}
       {showVersions && versionsPanelSlot}
     </div>
killedBy: DatasetItemsLayout renders the detail panel with vertical spacing when provided
statusReason: Unable to find an element by: [data-testid="detail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="grid h-full max-h-full min-h-0 grid-cols-[1fr_1fr] gap-4"
    >

[Killed] ConditionalExpression
datasets/components/items/dataset-items-layout.tsx:34:8
         {listSlot}
       </div>
       {showDetail && <div className="h-full min-h-0 py-3">{detailPanelSlot}</div>}
-      {showVersions && versionsPanelSlot}
+      {true}
     </div>
   );
killedBy: DatasetItemsLayout falls back to versions panel when there is no detail panel
statusReason: expected null not to be null

[Killed] ConditionalExpression
datasets/components/items/dataset-items-layout.tsx:34:8
         {listSlot}
       </div>
       {showDetail && <div className="h-full min-h-0 py-3">{detailPanelSlot}</div>}
-      {showVersions && versionsPanelSlot}
+      {false}
     </div>
   );
killedBy: DatasetItemsLayout falls back to versions panel when there is no detail panel
statusReason: expected null not to be null
